TestingStrategies-Particle/tests/Cases/AbramzonSirignano/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            patch;
        physicalType    particleOutflow;
        nFaces          625;
        startFace       45000;
    }
    side
    {
        type            patch;
        physicalType    particleOutflow;
        nFaces          2500;
        startFace       45625;
    }
    inletCoflow
    {
        type            patch;
        physicalType    noParticleOutflow;
        nFaces          625;
        startFace       48125;
    }
)

// ************************************************************************* //
